qmk/qmk_firmware/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L1/TARGET_MOTE_L152RC/stm32l152xc.h
/********************  Bit definition for RI_CICR2 register  ********************/
#define  RI_CICR2_PB                   ((uint32_t)0x0000FFFF) /*!< PB[15:0] Port B selection */
#define  RI_CICR2_PB_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR2_PB_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR2_PB_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR2_PB_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR2_PB_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR2_PB_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR2_PB_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR2_PB_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR2_PB_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR2_PB_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR2_PB_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR2_PB_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR2_PB_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR2_PB_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR2_PB_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR2_PB_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_ASMR3 register  ********************/
#define  RI_ASMR3_PC                   ((uint32_t)0x0000FFFF) /*!< PC[15:0] Port C selection */
#define  RI_ASMR3_PC_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_ASMR3_PC_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_ASMR3_PC_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_ASMR3_PC_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_ASMR3_PC_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_ASMR3_PC_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_ASMR3_PC_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_ASMR3_PC_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_ASMR3_PC_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_ASMR3_PC_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_ASMR3_PC_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_ASMR3_PC_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_ASMR3_PC_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_ASMR3_PC_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_ASMR3_PC_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_ASMR3_PC_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CMR3 register  ********************/
#define  RI_CMR3_PC                    ((uint32_t)0x0000FFFF) /*!< PC[15:0] Port C selection */
#define  RI_CMR3_PC_0                  ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CMR3_PC_1                  ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CMR3_PC_2                  ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CMR3_PC_3                  ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CMR3_PC_4                  ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CMR3_PC_5                  ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CMR3_PC_6                  ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CMR3_PC_7                  ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CMR3_PC_8                  ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CMR3_PC_9                  ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CMR3_PC_10                 ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CMR3_PC_11                 ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CMR3_PC_12                 ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CMR3_PC_13                 ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CMR3_PC_14                 ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CMR3_PC_15                 ((uint32_t)0x00008000) /*!< Bit 15 */

/********************  Bit definition for RI_CICR3 register  ********************/
#define  RI_CICR3_PC                   ((uint32_t)0x0000FFFF) /*!< PC[15:0] Port C selection */
#define  RI_CICR3_PC_0                 ((uint32_t)0x00000001) /*!< Bit 0 */
#define  RI_CICR3_PC_1                 ((uint32_t)0x00000002) /*!< Bit 1 */
#define  RI_CICR3_PC_2                 ((uint32_t)0x00000004) /*!< Bit 2 */
#define  RI_CICR3_PC_3                 ((uint32_t)0x00000008) /*!< Bit 3 */
#define  RI_CICR3_PC_4                 ((uint32_t)0x00000010) /*!< Bit 4 */
#define  RI_CICR3_PC_5                 ((uint32_t)0x00000020) /*!< Bit 5 */
#define  RI_CICR3_PC_6                 ((uint32_t)0x00000040) /*!< Bit 6 */
#define  RI_CICR3_PC_7                 ((uint32_t)0x00000080) /*!< Bit 7 */
#define  RI_CICR3_PC_8                 ((uint32_t)0x00000100) /*!< Bit 8 */
#define  RI_CICR3_PC_9                 ((uint32_t)0x00000200) /*!< Bit 9 */
#define  RI_CICR3_PC_10                ((uint32_t)0x00000400) /*!< Bit 10 */
#define  RI_CICR3_PC_11                ((uint32_t)0x00000800) /*!< Bit 11 */
#define  RI_CICR3_PC_12                ((uint32_t)0x00001000) /*!< Bit 12 */
#define  RI_CICR3_PC_13                ((uint32_t)0x00002000) /*!< Bit 13 */
#define  RI_CICR3_PC_14                ((uint32_t)0x00004000) /*!< Bit 14 */
#define  RI_CICR3_PC_15                ((uint32_t)0x00008000) /*!< Bit 15 */

/******************************************************************************/
/*                                                                            */
/*                               Timers (TIM)                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint32_t)0x00000001)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        ((uint32_t)0x00000002)            /*!<Update disable */
#define  TIM_CR1_URS                         ((uint32_t)0x00000004)            /*!<Update request source */
#define  TIM_CR1_OPM                         ((uint32_t)0x00000008)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         ((uint32_t)0x00000010)            /*!<Direction */

